zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k2x/pinctrl/MK26FN2M0CAC18-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MK26FN2M0CAC18/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MK24FN256VDC12-pinctrl.h with this part's differences applied
 * below (9 removed, 0 changed,
 * 254 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 29a4bf770d72f0ae
 */

#ifndef _ZEPHYR_DTS_BINDING_MK26FN2M0CAC18_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MK26FN2M0CAC18_WRAPPER_

#include "MK24FN256VDC12-pinctrl.h"

/* Signals not present on this part */
#undef UART5_CTS_b_PTD11
#undef UART5_RTS_b_PTD10
#undef UART5_RX_PTD8
#undef UART5_TX_PTD9
#undef USB_CLKIN_PTA5
#undef USB_CLKIN_PTE26
#undef USB_SOF_OUT_PTC0
#undef USB_SOF_OUT_PTC7
#undef USB_SOF_OUT_PTE6

/* Signals specific to this part */
#define ADC0_SE10_PTA7 KINETIS_MUX('A',7,0)
#define ADC0_SE11_PTA8 KINETIS_MUX('A',8,0)
#define ADC0_SE4a_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_SE6a_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE7a_PTE19 KINETIS_MUX('E',19,0)
#define ADC1_SE10_PTB4 KINETIS_MUX('B',4,0)
#define ADC1_SE11_PTB5 KINETIS_MUX('B',5,0)
#define CAN0_RX_PTA13 KINETIS_MUX('A',13,2)
#define CAN0_RX_PTA31 KINETIS_MUX('A',31,2)
#define CAN0_RX_PTB19 KINETIS_MUX('B',19,2)
#define CAN0_TX_PTA12 KINETIS_MUX('A',12,2)
#define CAN0_TX_PTA30 KINETIS_MUX('A',30,2)
#define CAN0_TX_PTB18 KINETIS_MUX('B',18,2)
#define CAN1_RX_PTB15 KINETIS_MUX('B',15,2)
#define CAN1_RX_PTC16 KINETIS_MUX('C',16,2)
#define CAN1_RX_PTE25 KINETIS_MUX('E',25,2)
#define CAN1_TX_PTB14 KINETIS_MUX('B',14,2)
#define CAN1_TX_PTC17 KINETIS_MUX('C',17,2)
#define CAN1_TX_PTE24 KINETIS_MUX('E',24,2)
#define CLKOUT_PTA6 KINETIS_MUX('A',6,5)
#define CMP2_IN0_PTA12 KINETIS_MUX('A',12,0)
#define CMP2_IN1_PTA13 KINETIS_MUX('A',13,0)
#define CMP2_OUT_PTA5 KINETIS_MUX('A',5,5)
#define CMP2_OUT_PTB22 KINETIS_MUX('B',22,6)
#define CMP3_IN1_PTA15 KINETIS_MUX('A',15,0)
#define CMP3_IN2_PTA16 KINETIS_MUX('A',16,0)
#define CMP3_IN4_PTA24 KINETIS_MUX('A',24,0)
#define CMP3_IN5_PTA25 KINETIS_MUX('A',25,0)
#define CMP3_OUT_PTB23 KINETIS_MUX('B',23,6)
#define CMP3_OUT_PTE19 KINETIS_MUX('E',19,6)
#define FTM0_CH3_PTA6 KINETIS_MUX('A',6,3)
#define FTM0_CH4_PTA7 KINETIS_MUX('A',7,3)
#define FTM0_FLT3_PTE16 KINETIS_MUX('E',16,6)
#define FTM1_CH0_PTA8 KINETIS_MUX('A',8,3)
#define FTM1_CH1_PTA9 KINETIS_MUX('A',9,3)
#define FTM1_FLT0_PTB4 KINETIS_MUX('B',4,6)
#define FTM1_QD_PHA_PTA8 KINETIS_MUX('A',8,6)
#define FTM1_QD_PHB_PTA9 KINETIS_MUX('A',9,6)
#define FTM2_FLT0_PTB5 KINETIS_MUX('B',5,6)
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6)
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6)
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6)
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6)
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6)
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6)
#define FTM_CLKIN0_PTE16 KINETIS_MUX('E',16,4)
#define FTM_CLKIN1_PTE17 KINETIS_MUX('E',17,4)
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4)
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4)
#define I2C3_SCL_PTA2 KINETIS_MUX('A',2,4)
#define I2C3_SCL_PTC29 KINETIS_MUX('C',29,2)
#define I2C3_SCL_PTE11 KINETIS_MUX('E',11,2)
#define I2C3_SDA_PTA1 KINETIS_MUX('A',1,4)
#define I2C3_SDA_PTC28 KINETIS_MUX('C',28,2)
#define I2C3_SDA_PTE10 KINETIS_MUX('E',10,2)
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4)
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2)
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4)
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4)
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4)
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2)
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4)
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4)
#define LLWU_P16_PTE6 KINETIS_MUX('E',6,1)
#define LLWU_P17_PTE9 KINETIS_MUX('E',9,1)
#define LLWU_P18_PTE10 KINETIS_MUX('E',10,1)
#define LLWU_P19_PTE17 KINETIS_MUX('E',17,1)
#define LLWU_P20_PTE18 KINETIS_MUX('E',18,1)
#define LLWU_P21_PTE25 KINETIS_MUX('E',25,1)
#define LLWU_P22_PTA10 KINETIS_MUX('A',10,1)
#define LLWU_P23_PTA11 KINETIS_MUX('A',11,1)
#define LLWU_P24_PTD8 KINETIS_MUX('D',8,1)
#define LLWU_P25_PTD11 KINETIS_MUX('D',11,1)
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,6)
#define LPUART0_CTS_b_PTA0 KINETIS_MUX('A',0,5)
#define LPUART0_CTS_b_PTC26 KINETIS_MUX('C',26,3)
#define LPUART0_CTS_b_PTD11 KINETIS_MUX('D',11,5)
#define LPUART0_CTS_b_PTE10 KINETIS_MUX('E',10,5)
#define LPUART0_RTS_b_PTA3 KINETIS_MUX('A',3,5)
#define LPUART0_RTS_b_PTC27 KINETIS_MUX('C',27,3)
#define LPUART0_RTS_b_PTD10 KINETIS_MUX('D',10,5)
#define LPUART0_RTS_b_PTE11 KINETIS_MUX('E',11,5)
#define LPUART0_RX_PTA1 KINETIS_MUX('A',1,5)
#define LPUART0_RX_PTC25 KINETIS_MUX('C',25,3)
#define LPUART0_RX_PTD8 KINETIS_MUX('D',8,5)
#define LPUART0_RX_PTE9 KINETIS_MUX('E',9,5)
#define LPUART0_TX_PTA2 KINETIS_MUX('A',2,5)
#define LPUART0_TX_PTC24 KINETIS_MUX('C',24,3)
#define LPUART0_TX_PTD9 KINETIS_MUX('D',9,5)
#define LPUART0_TX_PTE8 KINETIS_MUX('E',8,5)
#define PTA24 KINETIS_MUX('A',24,1)
#define PTA25 KINETIS_MUX('A',25,1)
#define PTA26 KINETIS_MUX('A',26,1)
#define PTA27 KINETIS_MUX('A',27,1)
#define PTA28 KINETIS_MUX('A',28,1)
#define PTA30 KINETIS_MUX('A',30,1)
#define PTA31 KINETIS_MUX('A',31,1)
#define PTA6 KINETIS_MUX('A',6,1)
#define PTA7 KINETIS_MUX('A',7,1)
#define PTA8 KINETIS_MUX('A',8,1)
#define PTA9 KINETIS_MUX('A',9,1)
#define PTB14 KINETIS_MUX('B',14,1)
#define PTB15 KINETIS_MUX('B',15,1)
#define PTB4 KINETIS_MUX('B',4,1)
#define PTB5 KINETIS_MUX('B',5,1)
#define PTC24 KINETIS_MUX('C',24,1)
#define PTC25 KINETIS_MUX('C',25,1)
#define PTC26 KINETIS_MUX('C',26,1)
#define PTC27 KINETIS_MUX('C',27,1)
#define PTC28 KINETIS_MUX('C',28,1)
#define PTC29 KINETIS_MUX('C',29,1)
#define PTE10 KINETIS_MUX('E',10,1)
#define PTE11 KINETIS_MUX('E',11,1)
#define PTE12 KINETIS_MUX('E',12,1)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE17 KINETIS_MUX('E',17,1)
#define PTE18 KINETIS_MUX('E',18,1)
#define PTE19 KINETIS_MUX('E',19,1)
#define PTE27 KINETIS_MUX('E',27,1)
#define PTE28 KINETIS_MUX('E',28,1)
#define PTE7 KINETIS_MUX('E',7,1)
#define PTE8 KINETIS_MUX('E',8,1)
#define PTE9 KINETIS_MUX('E',9,1)
#define SDHC0_CLKIN_PTD11 KINETIS_MUX('D',11,4)
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4)
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4)
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4)
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4)
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4)
#define SDHC0_D4_PTD12 KINETIS_MUX('D',12,4)
#define SDHC0_D5_PTD13 KINETIS_MUX('D',13,4)
#define SDHC0_D6_PTD14 KINETIS_MUX('D',14,4)
#define SDHC0_D7_PTD15 KINETIS_MUX('D',15,4)
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4)
#define SDRAM_A10_PTD4 KINETIS_MUX('D',4,5)
#define SDRAM_A11_PTD3 KINETIS_MUX('D',3,5)
#define SDRAM_A12_PTD2 KINETIS_MUX('D',2,5)
#define SDRAM_A13_PTC10 KINETIS_MUX('C',10,5)
#define SDRAM_A14_PTC9 KINETIS_MUX('C',9,5)
#define SDRAM_A15_PTC8 KINETIS_MUX('C',8,5)
#define SDRAM_A16_PTC7 KINETIS_MUX('C',7,5)
#define SDRAM_A17_PTC6 KINETIS_MUX('C',6,5)
#define SDRAM_A18_PTC5 KINETIS_MUX('C',5,5)
#define SDRAM_A19_PTC4 KINETIS_MUX('C',4,5)
#define SDRAM_A20_PTC2 KINETIS_MUX('C',2,5)
#define SDRAM_A21_PTC1 KINETIS_MUX('C',1,5)
#define SDRAM_A22_PTC0 KINETIS_MUX('C',0,5)
#define SDRAM_A23_PTB18 KINETIS_MUX('B',18,5)
#define SDRAM_A9_PTD5 KINETIS_MUX('D',5,5)
#define SDRAM_CAS_b_PTB0 KINETIS_MUX('B',0,5)
#define SDRAM_CKE_PTD7 KINETIS_MUX('D',7,5)
#define SDRAM_CS0_b_PTB3 KINETIS_MUX('B',3,5)
#define SDRAM_CS1_b_PTB4 KINETIS_MUX('B',4,5)
#define SDRAM_D0_PTC29 KINETIS_MUX('C',29,5)
#define SDRAM_D10_PTA31 KINETIS_MUX('A',31,5)
#define SDRAM_D11_PTA30 KINETIS_MUX('A',30,5)
#define SDRAM_D12_PTA27 KINETIS_MUX('A',27,5)
#define SDRAM_D13_PTA26 KINETIS_MUX('A',26,5)
#define SDRAM_D14_PTA25 KINETIS_MUX('A',25,5)
#define SDRAM_D15_PTA24 KINETIS_MUX('A',24,5)
#define SDRAM_D16_PTB17 KINETIS_MUX('B',17,5)
#define SDRAM_D17_PTB16 KINETIS_MUX('B',16,5)
#define SDRAM_D18_PTB11 KINETIS_MUX('B',11,5)
#define SDRAM_D19_PTB10 KINETIS_MUX('B',10,5)
#define SDRAM_D1_PTC28 KINETIS_MUX('C',28,5)
#define SDRAM_D20_PTB9 KINETIS_MUX('B',9,5)
#define SDRAM_D21_PTB8 KINETIS_MUX('B',8,5)
#define SDRAM_D22_PTB7 KINETIS_MUX('B',7,5)
#define SDRAM_D23_PTB6 KINETIS_MUX('B',6,5)
#define SDRAM_D24_PTC15 KINETIS_MUX('C',15,5)
#define SDRAM_D25_PTC14 KINETIS_MUX('C',14,5)
#define SDRAM_D26_PTC13 KINETIS_MUX('C',13,5)
#define SDRAM_D27_PTC12 KINETIS_MUX('C',12,5)
#define SDRAM_D28_PTB23 KINETIS_MUX('B',23,5)
#define SDRAM_D29_PTB22 KINETIS_MUX('B',22,5)
#define SDRAM_D2_PTC27 KINETIS_MUX('C',27,5)
#define SDRAM_D30_PTB21 KINETIS_MUX('B',21,5)
#define SDRAM_D31_PTB20 KINETIS_MUX('B',20,5)
#define SDRAM_D3_PTC26 KINETIS_MUX('C',26,5)
#define SDRAM_D4_PTC25 KINETIS_MUX('C',25,5)
#define SDRAM_D5_PTC24 KINETIS_MUX('C',24,5)
#define SDRAM_D6_PTB15 KINETIS_MUX('B',15,5)
#define SDRAM_D7_PTB14 KINETIS_MUX('B',14,5)
#define SDRAM_D8_PTB13 KINETIS_MUX('B',13,5)
#define SDRAM_D9_PTB12 KINETIS_MUX('B',12,5)
#define SDRAM_DQM0_PTC19 KINETIS_MUX('C',19,5)
#define SDRAM_DQM1_PTC18 KINETIS_MUX('C',18,5)
#define SDRAM_DQM2_PTC16 KINETIS_MUX('C',16,5)
#define SDRAM_DQM3_PTC17 KINETIS_MUX('C',17,5)
#define SDRAM_RAS_b_PTB1 KINETIS_MUX('B',1,5)
#define SDRAM_WE_PTB2 KINETIS_MUX('B',2,5)
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2)
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2)
#define SPI0_SIN_PTE19 KINETIS_MUX('E',19,2)
#define SPI0_SOUT_PTE18 KINETIS_MUX('E',18,2)
#define TPM1_CH0_PTA12 KINETIS_MUX('A',12,7)
#define TPM1_CH0_PTA8 KINETIS_MUX('A',8,6)
#define TPM1_CH0_PTB0 KINETIS_MUX('B',0,6)
#define TPM1_CH0_PTB12 KINETIS_MUX('B',12,6)
#define TPM1_CH1_PTA13 KINETIS_MUX('A',13,7)
#define TPM1_CH1_PTA9 KINETIS_MUX('A',9,6)
#define TPM1_CH1_PTB1 KINETIS_MUX('B',1,6)
#define TPM1_CH1_PTB13 KINETIS_MUX('B',13,6)
#define TPM2_CH0_PTA10 KINETIS_MUX('A',10,6)
#define TPM2_CH0_PTB18 KINETIS_MUX('B',18,6)
#define TPM2_CH1_PTA11 KINETIS_MUX('A',11,6)
#define TPM2_CH1_PTB19 KINETIS_MUX('B',19,6)
#define TPM_CLKIN0_PTA18 KINETIS_MUX('A',18,7)
#define TPM_CLKIN0_PTB16 KINETIS_MUX('B',16,7)
#define TPM_CLKIN0_PTC12 KINETIS_MUX('C',12,7)
#define TPM_CLKIN0_PTE16 KINETIS_MUX('E',16,7)
#define TPM_CLKIN1_PTA19 KINETIS_MUX('A',19,7)
#define TPM_CLKIN1_PTB17 KINETIS_MUX('B',17,7)
#define TPM_CLKIN1_PTC13 KINETIS_MUX('C',13,7)
#define TPM_CLKIN1_PTE17 KINETIS_MUX('E',17,7)
#define TRACE_CLKOUT_PTA6 KINETIS_MUX('A',6,7)
#define TRACE_CLKOUT_PTE0 KINETIS_MUX('E',0,5)
#define TRACE_D0_PTA10 KINETIS_MUX('A',10,7)
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,5)
#define TRACE_D1_PTA9 KINETIS_MUX('A',9,7)
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,5)
#define TRACE_D2_PTA8 KINETIS_MUX('A',8,7)
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,5)
#define TRACE_D3_PTA7 KINETIS_MUX('A',7,7)
#define TRACE_D3_PTE1 KINETIS_MUX('E',1,5)
#define TSI0_CH0_PTB0 KINETIS_MUX('B',0,0)
#define TSI0_CH10_PTB17 KINETIS_MUX('B',17,0)
#define TSI0_CH11_PTB18 KINETIS_MUX('B',18,0)
#define TSI0_CH12_PTB19 KINETIS_MUX('B',19,0)
#define TSI0_CH13_PTC0 KINETIS_MUX('C',0,0)
#define TSI0_CH14_PTC1 KINETIS_MUX('C',1,0)
#define TSI0_CH15_PTC2 KINETIS_MUX('C',2,0)
#define TSI0_CH1_PTA0 KINETIS_MUX('A',0,0)
#define TSI0_CH2_PTA1 KINETIS_MUX('A',1,0)
#define TSI0_CH3_PTA2 KINETIS_MUX('A',2,0)
#define TSI0_CH4_PTA3 KINETIS_MUX('A',3,0)
#define TSI0_CH5_PTA4 KINETIS_MUX('A',4,0)
#define TSI0_CH6_PTB1 KINETIS_MUX('B',1,0)
#define TSI0_CH7_PTB2 KINETIS_MUX('B',2,0)
#define TSI0_CH8_PTB3 KINETIS_MUX('B',3,0)
#define TSI0_CH9_PTB16 KINETIS_MUX('B',16,0)
#define UART2_CTS_b_PTE18 KINETIS_MUX('E',18,3)
#define UART2_RTS_b_PTE19 KINETIS_MUX('E',19,3)
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3)
#define UART2_TX_PTE16 KINETIS_MUX('E',16,3)
#define UART3_RTS_b_PTE7 KINETIS_MUX('E',7,3)
#define UART4_RTS_b_PTE27 KINETIS_MUX('E',27,3)
#define USB0_CLKIN_PTA5 KINETIS_MUX('A',5,2)
#define USB0_CLKIN_PTE26 KINETIS_MUX('E',26,7)
#define USB0_SOF_OUT_PTC0 KINETIS_MUX('C',0,4)
#define USB0_SOF_OUT_PTC7 KINETIS_MUX('C',7,3)
#define USB0_SOF_OUT_PTE6 KINETIS_MUX('E',6,7)
#define USB1_ID_PTE10 KINETIS_MUX('E',10,7)

#endif /* _ZEPHYR_DTS_BINDING_MK26FN2M0CAC18_WRAPPER_ */
